#+TITLE: Example of generation of simulations and projection
#+PROPERTY: header-args:jupyter-python :session example_projection
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args :tangle example_projection.py

This is an example of generation of simulations and projection. We first specify two templates, one
in equ coordinates and =CAR= pixellisation and one in equ coordinates and =HEALPIX= pixellisation. We
generate alms from a =CAMB= lensed power spectrum file and use them to generate a random CMB
realisation in both template. We then project the =HEALPIX= simulation and plot both the native =CAR=
simulation and the projected =HEALPIX= simulation. We chose a low resolution =nside= to emphasize the
effect of resolution

* Preamble
#+BEGIN_SRC jupyter-python
  %matplotlib inline
  import os
  import numpy as np
  import matplotlib as mpl
  import matplotlib.pyplot as plt
  import pspy, pixell
  print("     Numpy :", np.__version__)
  print("Matplotlib :", mpl.__version__)
  print("    pixell :", pixell.__version__)
  # print("      pspy :", pspy.__version__)
#+END_SRC

#+RESULTS:
:      Numpy : 1.17.4
: Matplotlib : 3.1.2
:     pixell : 0.6.0+34.g23be32d
: /home/garrido/Workdir/CMB/development/PSpipe/software/pspy/__init__.py

Get default data dir from =pspy= and set Planck colormap as default
#+BEGIN_SRC jupyter-python
  from pspy.so_config import DEFAULT_DATA_DIR
  pixell.colorize.mpl_setdefault("planck")
#+END_SRC

#+RESULTS:

* Computation of stokes parameters
We compute the stokes parameters from the alms in both templates
#+BEGIN_SRC jupyter-python
  from pspy import sph_tools
  map_healpix = sph_tools.alm2map(alms, template_healpix)
  map_car = sph_tools.alm2map(alms, template_car)
#+END_SRC

#+RESULTS:

and we project the =HEALPIX= map into the =CAR= template
#+BEGIN_SRC jupyter-python
  map_healpix_proj = so_map.healpix2car(map_healpix, map_car, lmax=lmax)
#+END_SRC

#+RESULTS:
: WARNING: your lmax is too large, setting it to 3*nside-1 now
: Preparing SHT
: T -> alm
: float64 complex128
: P -> alm
: Projecting

